# 계수 정렬: 특정한 조건이 부합할 때만 사용할 수 있지만 매우 빠른 정렬 알고리즘.
# 계수 정렬의 시간 복잡도: 데이터의 개수 N, 데이터 중 최댓값 K 일 때, O(N + K) 보장
# 다만, 계수 정렬은 '데이터의 크기 범위가 제한 되어 정수 형태로 표현할 수 있을 때'만 사용 가능
# 계수 정렬은, '모든 범위를 담을 수 있는 크기의 리스트를 선언'해야 하기 때문.

# 모든 원소의 값이 0 보다 크거나 같다고 가정
array = [7, 5, 9, 0, 3, 1, 6, 2, 9, 1, 4, 8, 0, 5, 2]

# 모든 범위를 포함하는 리스트 선언(모든 값은 0으로 초기화)
count = [0] * (max(array) + 1)

for i in range(len(array)):
    count[array[i]] += 1    # 각 데이터에 해당하는 인덱스의 값 증가

for i in range(len(count)): # 리스트에 기록된 정렬 정보 확인. 카운트 배열의 각 요소에 대해 반복
    for j in range(count[i]):   # 각 숫자가 등장한 횟수만큼 반복
        print(i, end=' ')   # 띄어쓰기를 구분으로 등장한 횟수만큼 인덱스 출력. 해당 숫자 i 를 등장횟수 count[i] 만큼 출력

# 계수 정렬은 데이터의 크기가 한정되어 있고, 데이터의 크기가 많이 중복되어 있을 수록 유리하며 항상 사용 x